/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   get_token.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: amerlon- <amerlon-@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/01/27 10:22:52 by amerlon-          #+#    #+#             */
/*   Updated: 2019/01/27 10:49:32 by amerlon-         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_printf.h"

/*
*	эта функция должна парсить строку и получать токен с шириной, точностью
*	и доп флагами
*/

void	get_token(const char *f, t_token *tok)
{

}
